app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("person_name", "person_address", "created_at", "updated_at", "aasm_state") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["person_name", "Noor Faiza"], ["person_address", "Hassan"], ["created_at", "2021-04-16 18:26:59.855317"], ["updated_at", "2021-04-16 18:26:59.855317"], ["aasm_state", "draft"]]
---
  def create
    @room = Room.new(room_params)
    #BookingService.new(@room)


    respond_to do |format|
      if @room.save

UPDATE "rooms" SET "updated_at" = $1, "aasm_state" = $2 WHERE "rooms"."id" = $3  [["updated_at", "2021-04-18 16:50:53.997442"], ["aasm_state", "draft"], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @room.update(room_params)

DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 980190962]]
---
  def destroy
    @room.destroy

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
UPDATE "rooms" SET "updated_at" = $1, "aasm_state" = $2 WHERE "rooms"."id" = $3  [["updated_at", "2021-04-18 17:02:38.771933"], ["aasm_state", "pre_reserved"], ["id", 980190962]]
---
  def change_state
    puts "current state....."
    room = Room.find(params[:room_id])
    room.pre_reserve!
    room.save!